espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x1_cc26x1/inc/hw_prcm.h
// Field:     [3] PGS
//
//
// NOT in use on AGAMA 704
// Writing any other value than the reset value may result in undefined
// behavior.
#define PRCM_MCUSRAMCFG_PGS                                         0x00000008
#define PRCM_MCUSRAMCFG_PGS_BITN                                             3
#define PRCM_MCUSRAMCFG_PGS_M                                       0x00000008
#define PRCM_MCUSRAMCFG_PGS_S                                                3

// Field:     [2] BM
//
//
// NOT in use on AGAMA 704
// Writing any other value than the reset value may result in undefined
// behavior.
#define PRCM_MCUSRAMCFG_BM                                          0x00000004
#define PRCM_MCUSRAMCFG_BM_BITN                                              2
#define PRCM_MCUSRAMCFG_BM_M                                        0x00000004
#define PRCM_MCUSRAMCFG_BM_S                                                 2

// Field:     [1] PCH_F
//
//
// NOT in use on AGAMA 704
// Writing any other value than the reset value may result in undefined
// behavior.
#define PRCM_MCUSRAMCFG_PCH_F                                       0x00000002
#define PRCM_MCUSRAMCFG_PCH_F_BITN                                           1
#define PRCM_MCUSRAMCFG_PCH_F_M                                     0x00000002
#define PRCM_MCUSRAMCFG_PCH_F_S                                              1

// Field:     [0] PCH_L
//
//
// NOT in use on AGAMA 704
// Writing any other value than the reset value may result in undefined
// behavior.
#define PRCM_MCUSRAMCFG_PCH_L                                       0x00000001
#define PRCM_MCUSRAMCFG_PCH_L_BITN                                           0
#define PRCM_MCUSRAMCFG_PCH_L_M                                     0x00000001
#define PRCM_MCUSRAMCFG_PCH_L_S                                              0

//*****************************************************************************
//
// Register: PRCM_O_RAMRETEN
//
//*****************************************************************************
// Field:     [3] RFCULL
//
// 0: Retention for RFC ULL SRAM disabled
// 1: Retention for RFC ULL SRAM enabled
//
// Memories controlled:
// CPEULLRAM
#define PRCM_RAMRETEN_RFCULL                                        0x00000008
#define PRCM_RAMRETEN_RFCULL_BITN                                            3
#define PRCM_RAMRETEN_RFCULL_M                                      0x00000008
#define PRCM_RAMRETEN_RFCULL_S                                               3

// Field:     [2] RFC
//
// 0: Retention for RFC SRAM disabled
// 1: Retention for RFC SRAM enabled
//
// Memories controlled: CPERAM  MCERAM  RFERAM  DSBRAM
#define PRCM_RAMRETEN_RFC                                           0x00000004
#define PRCM_RAMRETEN_RFC_BITN                                               2
#define PRCM_RAMRETEN_RFC_M                                         0x00000004
#define PRCM_RAMRETEN_RFC_S                                                  2

// Field:   [1:0] VIMS
//
//
// 0: Memory retention disabled
// 1: Memory retention enabled
//
// Bit 0: VIMS_TRAM
// Bit 1: VIMS_CRAM
//
// Legal modes depend on settings in VIMS:CTL.MODE
//
// 00: VIMS:CTL.MODE must be OFF before DEEPSLEEP is asserted - must be set to
// CACHE or SPLIT mode after waking up again
// 01: VIMS:CTL.MODE must be GPRAM before DEEPSLEEP is asserted. Must remain in
// GPRAM mode after wake up, alternatively select OFF mode first and then CACHE
// or SPILT mode.
// 10: Illegal mode
// 11: No restrictions
#define PRCM_RAMRETEN_VIMS_W                                                 2
#define PRCM_RAMRETEN_VIMS_M                                        0x00000003
#define PRCM_RAMRETEN_VIMS_S                                                 0

//*****************************************************************************
//
// Register: PRCM_O_OSCIMSC
//
//*****************************************************************************
// Field:     [7] HFSRCPENDIM
//
// 0: Disable interrupt generation when HFSRCPEND is qualified
// 1: Enable interrupt generation when HFSRCPEND is qualified
#define PRCM_OSCIMSC_HFSRCPENDIM                                    0x00000080
#define PRCM_OSCIMSC_HFSRCPENDIM_BITN                                        7
#define PRCM_OSCIMSC_HFSRCPENDIM_M                                  0x00000080
#define PRCM_OSCIMSC_HFSRCPENDIM_S                                           7

// Field:     [6] LFSRCDONEIM
//
// 0: Disable interrupt generation when LFSRCDONE is qualified
// 1: Enable interrupt generation when LFSRCDONE is qualified
#define PRCM_OSCIMSC_LFSRCDONEIM                                    0x00000040
#define PRCM_OSCIMSC_LFSRCDONEIM_BITN                                        6
#define PRCM_OSCIMSC_LFSRCDONEIM_M                                  0x00000040
#define PRCM_OSCIMSC_LFSRCDONEIM_S                                           6

// Field:     [5] XOSCDLFIM
//
// 0: Disable interrupt generation when XOSCDLF is qualified
// 1: Enable interrupt generation when XOSCDLF is qualified
#define PRCM_OSCIMSC_XOSCDLFIM                                      0x00000020
#define PRCM_OSCIMSC_XOSCDLFIM_BITN                                          5
#define PRCM_OSCIMSC_XOSCDLFIM_M                                    0x00000020
#define PRCM_OSCIMSC_XOSCDLFIM_S                                             5

// Field:     [4] XOSCLFIM
//
// 0: Disable interrupt generation when XOSCLF is qualified
// 1: Enable interrupt generation when XOSCLF is qualified
#define PRCM_OSCIMSC_XOSCLFIM                                       0x00000010
#define PRCM_OSCIMSC_XOSCLFIM_BITN                                           4
#define PRCM_OSCIMSC_XOSCLFIM_M                                     0x00000010
#define PRCM_OSCIMSC_XOSCLFIM_S                                              4

// Field:     [3] RCOSCDLFIM
//
// 0: Disable interrupt generation when RCOSCDLF is qualified
// 1: Enable interrupt generation when RCOSCDLF is qualified
#define PRCM_OSCIMSC_RCOSCDLFIM                                     0x00000008
#define PRCM_OSCIMSC_RCOSCDLFIM_BITN                                         3
#define PRCM_OSCIMSC_RCOSCDLFIM_M                                   0x00000008
#define PRCM_OSCIMSC_RCOSCDLFIM_S                                            3

